app/controllers/admin/brands_controller.rb

SELECT "brands".* FROM "brands" LIMIT 10 OFFSET 0
---
  def index
    @brands = Brand.page(params[:page]).per(10)