app/controllers/admin/categories_controller.rb

  def index
    @categories = Category.includes(:parent).page(params[:page]).per(10)
---
SELECT "categories".* FROM "categories" LIMIT 10 OFFSET 0

  def set_category
    @category = Category.friendly.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" != 12