app/controllers/admin/coupons_controller.rb

SELECT "coupons".* FROM "coupons" LIMIT 10 OFFSET 0
---
  def index
    @coupons = Coupon.page(params[:page]).per(10)