app/controllers/admin/customers_controller.rb

  def index
    authorize User
    @q = User.where(role: "customer").ransack(params[:q])
    @customers = @q.result(distinct: true).order(created_at: :desc).page(params[:page]).per(10)
---
SELECT COUNT(*) FROM "orders" WHERE "orders"."user_id" = 18
SELECT DISTINCT "users".* FROM "users" WHERE "users"."role" = 'customer' ORDER BY "users"."created_at" DESC LIMIT 10 OFFSET 0

  def set_customer
    @customer = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]