app/controllers/admin/dashboard_controller.rb

SELECT COUNT(*) FROM "orders"
SELECT SUM("orders"."total_amount") FROM "orders" WHERE "orders"."status" NOT IN ('cancelled', 'refunded')
SELECT "products".* FROM "products" WHERE (stock <= 5)
SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC LIMIT 5
---
  def index
    @total_orders = Order.count
    @total_revenue = Order.where.not(status: ["cancelled", "refunded"]).sum(:total_amount)
    @low_stock_products = Product.where("stock <= ?", 5)
    @recent_orders = Order.includes(:user).recent.limit(5)