app/controllers/admin/orders_controller.rb

  def index
    @q = Order.ransack(params[:q])
    @orders = @q.result(distinct: true).includes(:user).recent.page(params[:page]).per(10)
---
SELECT DISTINCT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC LIMIT 10 OFFSET 0

  def cancel
    authorize @order, :cancel?
    if @order.status != "cancelled"
      ActiveRecord::Base.transaction do
        @order.order_items.each do |item|
          product = item.product
          product.update!(stock: product.stock + item.quantity)
        end
        @order.update!(status: "cancelled")
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", "cancelled"], ["updated_at", "2026-07-15 16:16:19.099689"], ["id", 1]]

  def refund
    authorize @order, :refund?
    if @order.status == "cancelled" || @order.payment_status == "paid"
      @order.update!(status: "refunded", payment_status: "refunded")
---
UPDATE "orders" SET "payment_status" = ?, "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["payment_status", "refunded"], ["status", "refunded"], ["updated_at", "2026-07-15 16:16:19.107913"], ["id", 1]]