app/controllers/admin/pages_controller.rb

  def index
    @pages = Page.page(params[:page]).per(10)
---
SELECT "pages".* FROM "pages" LIMIT 10 OFFSET 0

  def update
    authorize @page
    if @page.update(page_params)
---
UPDATE "pages" SET "meta_title" = '', "meta_description" = '', "updated_at" = '2026-07-19 01:13:30.035057' WHERE "pages"."id" = 18