app/controllers/admin/products_controller.rb

SELECT "brands".* FROM "brands" WHERE "brands"."id" IN (11, 12)
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (12, 13)
---
  def index
    @q = Product.ransack(params[:q])
    @products = @q.result(distinct: true).includes(:category, :brand).page(params[:page]).per(10)

INSERT INTO "products" ("best_seller", "brand_id", "category_id", "created_at", "description", "discount_price", "featured", "meta_description", "meta_title", "name", "new_arrival", "price", "rating", "reviews_count", "short_description", "sku", "slug", "stock", "updated_at", "weight") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @product = Product.new(product_params)
    authorize @product
    if @product.save

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1]]
---
  def destroy
    authorize @product
    @product.destroy