app/controllers/admin/testimonials_controller.rb

  def index
    @testimonials = Testimonial.page(params[:page]).per(10)
---
SELECT "testimonials".* FROM "testimonials" LIMIT 10 OFFSET 0