app/controllers/admin/users_controller.rb

  def index
    authorize User
    @users = User.page(params[:page]).per(10)
---
SELECT "users".* FROM "users" LIMIT 10 OFFSET 0