app/views/admin/dashboard/index.html.erb

                  <td><strong>#<%= order.id %></strong></td>
                  <td><%= order.user&.first_name || 'Guest' %> <%= order.user&.last_name %></td>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 16 ORDER BY "users"."id" ASC LIMIT 1