app/views/admin/reviews/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 16 ORDER BY "users"."id" ASC LIMIT 1
---
            <tr>
              <td><strong><%= review.user.first_name %> <%= review.user.last_name %></strong></td>