app/views/admin/orders/index.html.erb

                  <% if order.user %>
                    <span class="fw-semibold text-dark"><%= "#{order.user.first_name} #{order.user.last_name}".strip.presence || order.user.email %></span>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 16 ORDER BY "users"."id" ASC LIMIT 1