app/views/shop/index.html.erb

SELECT "categories".* FROM "categories"
---
              <%= f.label :category_id_eq, "Category", class: "form-label small text-muted" %>
              <%= f.collection_select :category_id_eq, Category.all, :id, :name, { include_blank: "All Categories" }, { class: "form-select" } %>