app/views/shop/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                <div class="d-flex justify-content-between align-items-center mb-2">
                  <h6 class="fw-bold m-0"><%= review.user.first_name %> <%= review.user.last_name %></h6>