app/views/admin/products/index.html.erb

      <%= f.label :category_id_eq, "Category", class: "form-label small text-muted" %>
      <%= f.collection_select :category_id_eq, Category.all, :id, :name, { include_blank: "All Categories" }, { class: "form-select" } %>
---
SELECT "categories".* FROM "categories"

      <%= f.label :brand_id_eq, "Brand", class: "form-label small text-muted" %>
      <%= f.collection_select :brand_id_eq, Brand.all, :id, :name, { include_blank: "All Brands" }, { class: "form-select" } %>
---
SELECT "brands".* FROM "brands"