app/controllers/carts_controller.rb

  def show
    @subtotal = 0
    @cart_items.each do |item|
      @subtotal += item[:product].active_price * item[:quantity]
    end

    @discount = 0
    if session[:coupon_code].present?
      coupon = Coupon.active.find_by(code: session[:coupon_code])
---
SELECT "coupons".* FROM "coupons" WHERE "coupons"."active" = ? AND (expiry_date IS NULL OR expiry_date >= ?) AND "coupons"."code" = ? LIMIT ?  [["active", 1], [nil, "2026-07-15 16:22:45.318852"], ["code", "DISCOUNT50"], ["LIMIT", 1]]

  def apply_coupon
    coupon_code = params[:coupon_code].to_s.strip.upcase
    coupon = Coupon.active.find_by(code: coupon_code)
---
SELECT "coupons".* FROM "coupons" WHERE "coupons"."active" = ? AND (expiry_date IS NULL OR expiry_date >= ?) AND "coupons"."code" = ? LIMIT ?  [["active", 1], [nil, "2026-07-15 16:22:45.315917"], ["code", "DISCOUNT50"], ["LIMIT", 1]]

  def set_cart_items
    session[:cart] ||= {}
    @cart_items = []
    session[:cart].each do |prod_id, qty|
      product = Product.find_by(id: prod_id)
---
SELECT "products".* FROM "products" WHERE "products"."id" = 12 LIMIT 1