app/controllers/checkout_controller.rb

INSERT INTO "addresses" ("user_id", "address_type", "full_name", "address_line1", "address_line2", "city", "state", "zip_code", "country", "phone", "created_at", "updated_at") VALUES (NULL, 'shipping', 'Test name', 'test', 'test', 'test', 'test', '560001', 'India', '1234567890', '2026-07-15 17:06:40.676893', '2026-07-15 17:06:40.676893') RETURNING "id"
INSERT INTO "addresses" ("user_id", "address_type", "full_name", "address_line1", "address_line2", "city", "state", "zip_code", "country", "phone", "created_at", "updated_at") VALUES (NULL, 'billing', 'Test name', 'test', 'test', 'test', 'test', '560001', 'India', '1234567890', '2026-07-15 17:06:40.692232', '2026-07-15 17:06:40.692232') RETURNING "id"
---
  def create
    shipping_params = params.require(:shipping_address).permit(:full_name, :address_line1, :address_line2, :city, :state, :zip_code, :country, :phone)

    if params[:billing_same_as_shipping] == "1"
      billing_params = shipping_params.dup
    else
      billing_params = params.require(:billing_address).permit(:full_name, :address_line1, :address_line2, :city, :state, :zip_code, :country, :phone)
    end

    guest_email = params[:guest_email]

    @shipping_address = Address.new(shipping_params.merge(address_type: "shipping"))
    @billing_address = Address.new(billing_params.merge(address_type: "billing"))

    if @shipping_address.valid? && @billing_address.valid?
      @shipping_address.save!
      @billing_address.save!

SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = 1 LIMIT 1
SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = 2 LIMIT 1
---
  def payment
    @shipping_address = Address.find_by(id: session[:shipping_address_id])
    @billing_address = Address.find_by(id: session[:billing_address_id])

SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = 1 LIMIT 1
SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = 2 LIMIT 1
INSERT INTO "orders" ("user_id", "status", "subtotal_amount", "shipping_amount", "discount_amount", "total_amount", "coupon_code", "payment_method", "payment_status", "razorpay_order_id", "razorpay_payment_id", "shipping_address_id", "billing_address_id", "tracking_number", "carrier", "notes", "created_at", "updated_at") VALUES (NULL, 'pending', 89000.0, 0.0, 0.0, 89000.0, NULL, 'cod', 'pending', NULL, NULL, 1, 2, NULL, NULL, '', '2026-07-15 17:06:58.046574', '2026-07-15 17:06:58.046574') RETURNING "id"
SELECT "products".* FROM "products" WHERE "products"."id" = 12 LIMIT 1
INSERT INTO "order_items" ("order_id", "product_id", "quantity", "price", "total_price", "created_at", "updated_at") VALUES (1, 12, 1, 89000.0, 89000.0, '2026-07-15 17:06:58.095832', '2026-07-15 17:06:58.095832') RETURNING "id"
UPDATE "products" SET "stock" = 1, "updated_at" = '2026-07-15 17:06:58.110710' WHERE "products"."id" = 12
---
  def payment_callback
    @shipping_address = Address.find(session[:shipping_address_id])
    @billing_address = Address.find(session[:billing_address_id])

    user = current_user
    payment_method = params[:payment_method]

    ActiveRecord::Base.transaction do
      order = Order.new(
        user: user,
        status: "pending",
        payment_method: payment_method,
        payment_status: (payment_method == "cod" ? "pending" : "paid"),
        shipping_address: @shipping_address,
        billing_address: @billing_address,
        subtotal_amount: @subtotal,
        shipping_amount: @shipping_fee,
        discount_amount: @discount,
        total_amount: @total,
        notes: params[:notes]
      )

      if session[:coupon_code].present?
        coupon = Coupon.active.find_by(code: session[:coupon_code])
        if coupon
          order.coupon = coupon
          coupon.update!(usage_count: coupon.usage_count + 1)
        end
      end

      order.save!

      session[:cart].each do |prod_id, qty|
        product = Product.find(prod_id)
        raise ActiveRecord::Rollback if product.stock < qty

        OrderItem.create!(
          order: order,
          product: product,
          quantity: qty,
          price: product.active_price,
          total_price: product.active_price * qty
        )
        product.update!(stock: product.stock - qty)

SELECT "orders".* FROM "orders" WHERE "orders"."id" = 1 LIMIT 1
---
  def confirmation
    @order = Order.find(params[:order_id])

SELECT "products".* FROM "products" WHERE "products"."id" = 12 LIMIT 1
---
  def set_cart_totals
    @subtotal = 0
    session[:cart].each do |prod_id, qty|
      product = Product.find_by(id: prod_id)