app/controllers/home_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."parent_id" IS NULL LIMIT 6
SELECT "products".* FROM "products" WHERE "products"."featured" = TRUE LIMIT 8
SELECT "products".* FROM "products" WHERE "products"."best_seller" = TRUE LIMIT 8
SELECT "testimonials".* FROM "testimonials" WHERE "testimonials"."active" = TRUE LIMIT 5
---
  def index
    @banners = Banner.active.ordered
    @featured_categories = Category.where(parent_id: nil).limit(6)
    @featured_products = Product.where(featured: true).limit(8)
    @best_sellers = Product.where(best_seller: true).limit(8)
    @testimonials = Testimonial.active.limit(5)