app/controllers/reviews_controller.rb

  def create
    @review = current_user.reviews.build(review_params)
    @review.status = "pending" # Force pending status for moderation

    if @review.save
---
INSERT INTO "reviews" ("body", "created_at", "product_id", "rating", "status", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"