app/controllers/shop_controller.rb

SELECT "brands".* FROM "brands" WHERE "brands"."id" IN (6, 5)
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (7, 6)
SELECT COUNT(DISTINCT "products"."id") FROM "products" WHERE "products"."category_id" = 7
SELECT DISTINCT "products".* FROM "products" WHERE "products"."category_id" = 7 ORDER BY created_at desc LIMIT 12 OFFSET 0
---
  def index
    sort_option = case params[:sort]
                  when "price_asc" then "price asc"
                  when "price_desc" then "price desc"
                  when "rating_desc" then "rating desc"
                  else "created_at desc"
                  end

    @q = Product.ransack(params[:q])
    @products = @q.result(distinct: true)
                  .includes(:category, :brand)
                  .order(sort_option)
                  .page(params[:page]).per(12)

SELECT "products".* FROM "products" WHERE "products"."slug" = 'pure-amla-hibiscus-herbal-hair-oil' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @product = Product.friendly.find(params[:slug])
    @approved_reviews = @product.reviews.approved.includes(:user).recent