app/jobs/send_order_email_job.rb

  def perform(order_id)
    order = Order.find(order_id)
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 1 LIMIT 1